# Aufgabe: Pandas - Mystery Game

Folgend spielen wir ein kleines Spiel. Achten Sie auf die Details, halten Sie die Augen offen und schließen Sie Schlussfolgerungen um den Täter zu finden!!

### Voraussetzungen:

* Logische Abfrage in DataFrame: report1 = crime_scene_report[crime_scene_report['date'] == 20180115]
* Sortieren nach einer Spalte: person_address.sort_values('address_number')
* person_address.sort_values('address_number', ascending=False)
* Zeilen, die in einer Spalte einen bestimmten Substring enthalten: person[person.name.str.contains('Annabel')]

In [14]:
# import pandas
import pandas as pd
pd.options.display.max_colwidth = 500

In [15]:
get_fit_now_check_in = pd.read_csv('get_fit_now_check_in.csv')
get_fit_now_member = pd.read_csv('get_fit_now_member.csv')
drivers_license = pd.read_csv('drivers_license.csv')
person = pd.read_csv('person.csv')
crime_scene_report = pd.read_csv('crime_scene_report.csv')
interview = pd.read_csv('interview.csv')

Es hat ein Verbrechen stattgefunden, und der Kommissar braucht Ihre Hilfe. Der Kommissar gab Ihnen den Tatortbericht, aber Sie haben ihn irgendwie verloren. Sie erinnern sich vage daran, dass es sich bei dem Verbrechen um einen Mord handelte, der sich irgendwann am 15. Januar 2018 ereignete, und dass er in SQL City stattfand. Beginnen Sie damit, den entsprechenden Tatortbericht (report) aus der richtigen Datei der Polizeibehörde anzuzeigen.

**Fangen wir an:**

**STEP 1** Wie sieht der Tatortbericht so aus?

In [16]:
# ersten Zeilen des Tatortberichts
crime_scene_report.head()

       date     type                                              description      city
0  20180115  robbery        A Man Dressed as Spider-Man Is on a Robbery Spree       NYC
1  20180115   murder                        Life? Dont talk to me about life.    Albany
2  20180115   murder      Mama, I killed a man, put a gun against his head...      Reno
3  20180215   murder                               REDACTED REDACTED REDACTED  SQL City
4  20180215   murder  Someone killed the guard! He took an arrow to the knee!  SQL City

**STEP 2** Der Mord hat am 15.01.2018 statt gefunden in SQL City..

In [36]:
# Anzeigen der Information
report1 = crime_scene_report[crime_scene_report['date'] == 20180115]
report2 = report1[report1['type'] == 'murder']
report3 = report2[report2['city'] == 'SQL City']
report3

          date    type                                                                                                                                                                                description      city
1227  20180115  murder  Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".  SQL City

Finden Sie nun folgend die **Zeugen** und Ihre **Aussagen**:

**STEP 3** Wer ist der erste Zeuge, was hat dieser gesehen und ausgesagt?

In [22]:
person_address = person[person['address_street_name'] == 'Northwestern Dr']
sorted_pa = person_address.sort_values('address_number', ascending=False)
zeuge1 = sorted_pa[sorted_pa.address_number == max(sorted_pa.address_number)]
name_zeuge1 = zeuge1.name
id_zeuge1 = int(zeuge1.id)
zeuge1

        id            name  license_id  address_number address_street_name        ssn
499  14887  Morty Schapiro      118009            4919     Northwestern Dr  111564949

In [26]:
aussage_zeuge1 = interview[interview.person_id == id_zeuge1]
aussage_zeuge1.transcript

4988    I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".
Name: transcript, dtype: object

**STEP 4** Hat der zweite Zeuge noch weitere wichtige Details festgestellt?

In [24]:
zeuge2_name = person[person.name.str.contains('Annabel')]
zeuge2 = zeuge2_name[zeuge2_name.address_street_name == 'Franklin Ave']
name_zeuge2 = zeuge2.name
id_zeuge2 = int(zeuge2.id)
zeuge2

        id            name  license_id  address_number address_street_name        ssn
665  16371  Annabel Miller      490173             103        Franklin Ave  318771143

In [25]:
aussage_zeuge2 = interview[interview.person_id == id_zeuge2]
aussage_zeuge2

      person_id                                                                                                             transcript
4989      16371  I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

**STEP 5** Tragen Sie kurz und prägnant die wichtigsten Details der **Zeugenaussagen** zusammen:

Täter geht zu "Get Fit Now Gym". Mitgliedsnummer fängt mit "48Z" an. Er ist gold-member. Autokennzeichen beinhaltet die Zeichen "H42W". Er war am 09. Januar im Fitness-Center.

**STEP 6** Können Wir mit diesen Aussagen eventuell ein paar weitere Details herausfinden? Vielleicht finden wir ja etwas im Fitenss-Center Mitglieder Verzeichnis.

In [27]:
# filtert nach Status und Mitgliedsnummer
taeter = get_fit_now_member[get_fit_now_member['membership_status'] == 'gold']
taeter = taeter[taeter['id'].str.contains('48Z')]
taeter

        id  person_id           name  membership_start_date membership_status
181  48Z7A      28819   Joe Germuska               20160305              gold
182  48Z55      67318  Jeremy Bowers               20160101              gold

Hmmm.. Da haben wir ja nun Verdächtige. Nehmen wir diese mal unter die Lupe..

**STEP 7** Wir haben die Namen und die Id's, mal checken wer am entsprechenden Datum im Fitness-Center war:

In [30]:
joe_germuska_id = 28819
jeremy_bowers_id = 67318
#Prüfe Anwesenheit Fitness 20180109

on_date = get_fit_now_check_in[get_fit_now_check_in.check_in_date == 20180109]
on_date_with_id = on_date[(on_date.membership_id.str.contains('48Z'))]
on_date_with_id #keine zusätzliche Information

     membership_id  check_in_date  check_in_time  check_out_time
2700         48Z7A       20180109           1600            1730
2701         48Z55       20180109           1530            1700

**STEP 8** Ist der Verdächtige nicht mit einem Auto weggefahren??

In [31]:
#Erhalte Kennzeichen aus person
x = person[person.id == 28819]
joe_germuska_license_id = 173289
x = person[person.id == 67318]
jeremy_bowers_license_id = 423327

In [32]:
drivers_license.head()

       id  age  height eye_color hair_color  gender plate_number  car_make car_model
0  100280   72      57     brown        red    male       P24L4U     Acura       MDX
1  100460   63      72     brown      brown  female       XF02T6  Cadillac       SRX
2  101029   62      74     green      green  female       VKY5KR     Scion        xB
3  101198   43      54     amber      brown  female       Y5NZ08    Nissan     Rogue
4  101255   18      79      blue       grey  female       5162Z1     Lexus        GS

In [33]:
drivers_license[drivers_license.id == joe_germuska_license_id]

Empty DataFrame
Columns: [id, age, height, eye_color, hair_color, gender, plate_number, car_make, car_model]
Index: []

In [34]:
drivers_license[drivers_license.id == jeremy_bowers_license_id]

          id  age  height eye_color hair_color gender plate_number   car_make car_model
3529  423327   30      70     brown      brown   male       0H42W2  Chevrolet  Spark LS

**STEP 9** Wer ist der Mörder?

beinhaltet als kennzeichen 'H42W' => Täter = **Jeremy Bowers**